app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello Rails"], ["body", "I am on rails"], ["created_at", "2021-07-16 09:17:27.388697"], ["updated_at", "2021-07-16 09:17:27.388697"]]